Repository: Pedro-L-Lopes/crm
Catalog: src/Shared/CRM.Exceptions/ResourceMessageException.*.resx
Languages: fr, pt_br

# ACCOUNT_TYPE_EMPTY
source: Account type is required
fr: Le type de compte est requis
pt_br: O tipo de conta é obrigatório.

# ACCOUNT_TYPE_INVALID
source: The user type must be 'individual', 'agent', or 'agency
fr: Le type d'utilisateur doit être 'individual', 'agent' ou 'agency'
pt_br: O tipo do usuário deve ser 'individual', 'agent' ou 'agency'.

# AMOUNT_PAID_NEGATIVE
source: Amount paid cannot be negative.
pt_br: O valor pago não pode ser negativo.

# BILLING_CYCLE_INVALID
source: Billing cycle is invalid.
pt_br: O ciclo de cobrança é inválido.

# CONFIRM_PASSWORD_MATCH
source: The passwords do not match.
fr: Les mots de passe ne correspondent pas.
pt_br: As senhas não coincidem.

# CONFIRM_PASSWORD_REQUIRED
source: Confirm password is required
fr: La confirmation du mot de passe est obligatoire
pt_br: A confirmação de senha é obrigatória

source: E-mail alredy registered
fr: Email déjà enregistré
pt_br: E-mail já cadastrado

# EMAIL_EMPTY
source: The e-mail cannot be empty
fr: L'email est requis
pt_br: O E-mail não pode ficar vazio

# EMAIL_INVALID
source: The e-mail address invalid
fr: L'email fourni est invalide
pt_br: O E-mail é inválido

source: E-mail or password invalid
pt_br: E-mail e/ou senha inválidos

# END_DATE_AFTER_START_DATE
source: End date must be after the start date.
pt_br: A data de término deve ser posterior à data de início.

# END_DATE_REQUIRED
source: End date is required.
pt_br: A data de término é obrigatória.

# GENDER_EMPTY
source: The gender cannot be empty
pt_br: Gênero invalido

# GENDER_INVALID
source: Invalid gender
pt_br: Gênero invalido

source: Inactive plan
pt_br: Plano inativo

source: Invalid password
pt_br: Senha invalida

# INVALID_TENANT
source: Invalid organization
fr: Organisation invalide
pt_br: Organização inválida

# INVOICE_URL_MAX_LENGTH_EXCEEDED
source: Invoice URL must be at most 255 characters long.
pt_br: A URL da fatura deve ter no máximo 255 caracteres.

# NAME_EMPTY
source: The name cannot be empty
fr: Le nom ne peut pas être vide
pt_br: O nome não pode estar vazio

# NAME_LENGTH
source: The name cannot have fewer than 3 characters and cannot have more than 50.
fr: Le nom doit comporter au moins 3 caractères
pt_br: O nome não pode ter menos de 3 caracteres e não pode ter mais de 50.

# NO_TOKEN
source: No access token
pt_br: Sem token de acesso

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: Password different of current password
pt_br: A senha é diferente da senha atual

source: Password empty
pt_br: A senha não pode ser vazia

# PASSWORD_LENGTH
source: The password must be at least 6 characters long.
pt_br: A senha deve ter pelo menos 6 caracteres.

# PASSWORD_REQUIRED
source: The password is required
pt_br: A senha é obrigatório

# PASSWORD_RULE_1
source: The password must contain at least one uppercase letter.
pt_br: A senha deve conter ao menos uma letra maiúscula.

# PASSWORD_RULE_2
source: The password must contain at least one lowercase letter.
pt_br: A senha deve conter ao menos uma letra minúscula.

# PASSWORD_RULE_3
source: The password must contain at least one number.
pt_br: A senha deve conter ao menos um número.

# PAYMENT_METHOD_INVALID
source: Payment method is invalid.
pt_br: O método de pagamento é inválido.

# PAYMENT_STATUS_INVALID
source: Payment status is invalid.
pt_br: status de pagamento é inválido.

# PHONE_EMPTY
source: The phone number cannot be empty
pt_br: O telefone não pode ficar vazio

source: Phone invalid
pt_br: Número de telefone inválido

# PHONE_MAX_LENTH
source: The number cannot have more than 14 digits.
fr: Le nombre ne peut pas comporter plus de 14 chiffres.
pt_br: O número não pode ter mais de 14 dígitos

# PLAN_ID_EMPTY
source: The selected plan is required
fr: Le plan sélectionné est requis
pt_br: Selecione um plano

# PLAN_NOT_FOUND_OR_INACTIVE
source: Plan not found or inative
pt_br: O plano selecionado não foi encontrado ou não está ativo.

# PLAN_STATUS_INVALID
source: Plan status is invalid.
pt_br: O status do plano é inválido.

# ROLE_MUST_BE
source: The role must be one of the following: 'owner', 'admin', 'manager', 'agent', 'client', 'financial', or 'assistant'.
pt_br: O cargo deve ser um dos seguintes: 'owner', 'admin', 'manager', 'agent', 'client', 'financial' ou 'assistant'.

# ROLE_REQUIRED
source: The role is required
pt_br: O cargo do usuário é obrigatório.

# START_DATE_REQUIRED
source: Start date is required.
pt_br: A data de início é obrigatória.

# TENANT_REQUIRED
source: The user needs to be associated with a tenant.
pt_br: O usuário precisa estar associado a um tenant.

source: Unknow error
pt_br: Erro desconhecido

# USER_WITHOUT_PERMISSION_ACCESS_RESOURCE
source: User without permission to access this resource
pt_br: Usuário sem permissão para acessar esse recurso
